#停车场类别
PARKING_TYPE = {"小区":1, "占道": 2}
#服务种类
PARKING_SERVICE_KIND = {"临停": 0, "包月": 1, "临停/包月": 3}
#停车场状态
PARKING_STATE = {"开放": 0,"关闭": 1}

#订单状态
ORDER_STATE = {"待入场": 0, "已入场": 1, "缴费离场":3, "预约超时":5, "车主取消":9}

#车辆颜色
VEHICLE_COLOR = {"红色": "red", "白色": "white", "黑色":"black", "蓝色":"blue", "黄色":"yellow", "灰色":"gray", "其他":"other"}

#新能源标志
NER = {"是":"yes", "否":"no"}

#车辆类型
VEHICLE_TYPE = {"小型车":"car", "SUV":"suv", "其他":"other"}

#消息类型
MESSAGE_TYPE = {"系统消息":1, "入场提醒":2, "缴费通知":3, "超时提醒":4}

#接收方式
RECEIVE_TYPE = {"小程序":1, "手机短信":2, "公众号":4}

#发票类型
INVOICE_TYPE = {"企业单位":1, "个人/非企业":2}

#车主评价标签
PARKING_EVALUATION = {"车位好找":1, "环境干净卫生":2, "车位够大":3, "工作人员态度好":4, "便宜":5, "非常方便":6}