#停车场类别
PARKING_TYPE = {"有人值守": 0, "无人值守": 1}

#服务模式
PARKING_SERVICE_MODE = {"普通预约": 1, "强预约": 2, "普通/强预约": 3}

#服务种类
PARKING_SERVICE_KIND = {"临停": 0, "包月": 1, "临停/包月": 3}

#停车场状态
PARKING_STATE = {"开放": 0, "关闭": 1}

#订单状态
ORDER_STATE = {"已预约": 0, "进场(已确认)": 1, "进场（已扫码）": 10, "已结清": 20, "已离场": 3, "已关闭": 100,"预约超时": 5, "取消": 9}

#车辆颜色
VEHICLE_COLOR = {"红色": "red", "白色": "white", "黑色":"black", "蓝色":"blue", "黄色":"yellow", "灰色":"gray", "其他":"other"}

#新能源标志
NER = {"是":"yes", "否":"no"}

#车辆类型
VEHICLE_TYPE = {"小型车":"car", "SUV":"suv", "其他":"other"}

#消息类型
MESSAGE_TYPE = {"系统消息":1, "入场提醒":2, "离场通知":3, "超时提醒":5}

#接收方式
RECEIVE_TYPE = {"小程序":1, "手机短信":2, "公众号":4}

#发票类型
INVOICE_TYPE = {"企业单位":1, "个人/非企业":2}

#车主评价标签
PARKING_EVALUATION = {"车位好找":1, "环境干净卫生":2, "车位够大":3, "工作人员态度好":4, "便宜":5, "非常方便":6}

#支付状态
PAY_STATE = {"本笔待付": 0, "本笔已付": 1, "本笔免付":9, "已退款": -1}

#支付名目
PAY_ITEM = {"预约服务费": 0, "停车费": 1}

#支付通道
PAY_CHANNEL = {"熊猫泊车-微信小程序" : 0, "熊猫泊车-现金支付": 1, "业主系统-直接支付":9}